MyHome/src/DataProcessors/ЗагрузкаБанковскихВыписок/ЗагрузкаБанковскихВыписок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаБанковскихВыписок</name>
  <attributes>
    <name>ФайлДляЗагрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантЗагрузки</name>
    <type>
      <types>EnumRef.ВариантыЗагрузкиБанковскихВыписок</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеВыписки</name>
    <attributes>
      <name>ДатаОперации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторКарты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбойЗнак</types>
      </type>
    </attributes>
    <attributes>
      <name>Категория</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>МСС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

MyHome/src/Enums/ВариантыЗагрузкиБанковскихВыписок/ВариантыЗагрузкиБанковскихВыписок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыЗагрузкиБанковскихВыписок</name>
  <enumValues>
    <name>Тинькофф</name>
  </enumValues>
  <enumValues>
    <name>Сбербанк</name>
  </enumValues>
</mdclass:Enum>

MyHome/src/DataProcessors/ЗагрузкаБанковскихВыписок/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Читает файл выписки в таблицу значений
// 
// Параметры:
// 	ПараметрыЧтения - Структура:
// 	 * ВариантЗагрузки - ПеречислениеСсылка.ВариантыЗагрузкиБанковскихВыписок - Вариант загрузки выписки
// 	 * АдресХранилищаФайла - Строка - Адрес файла выписки во временном хранилище
// 	 * ПараметрыФайла - Структура - Параметры файла выписки
// Возвращаемое значение:
//  - ТаблицаЗначений - Прочитанные данные 	
Функция ПрочитатьДанныеФайла(ПараметрыЧтения) Экспорт
	
	ВариантЗагрузки = ПараметрыЧтения.ВариантЗагрузки;
	
	Если ВариантЗагрузки = ПредопределенноеЗначение("Перечисление.ВариантыЗагрузкиБанковскихВыписок.Тинькофф") Тогда
		ТаблицаДанныхФайла = ПрочитатьДанныеФайлаТинькофф(ПараметрыЧтения);
		ТаблицаДанных = ЗаполнитьТаблицуДанныхПоДаннымФайлаТинькофф(ТаблицаДанныхФайла);
	Иначе
		ВызватьИсключение "Неизвестный вариант выписки";
	КонецЕсли;
	
	Возврат ТаблицаДанных;
	
КонецФункции

// Читает файл выписки в таблицу значений
// 
// Параметры:
// 	ПараметрыЧтения - Структура:
// 	 * ВариантЗагрузки - ПеречислениеСсылка.ВариантыЗагрузкиБанковскихВыписок - Вариант загрузки выписки
// 	 * АдресХранилищаФайла - Строка - Адрес файла выписки во временном хранилище
// 	 * ПараметрыФайла - Структура - Параметры файла выписки
// Возвращаемое значение:
//  - ТаблицаЗначений - Прочитанные данные 	
Функция ПрочитатьДанныеФайлаТинькофф(ПараметрыЧтения)
	
	ВременныйФайл = ПолучитьИмяВременногоФайла(ПараметрыЧтения.ПараметрыФайла.Расширение);
	
	ДанныеФайла = ПолучитьИзВременногоХранилища(ПараметрыЧтения.АдресХранилищаФайла);
	ДанныеФайла.Записать(ВременныйФайл);
	
	ТабличныйДокумент = Новый ТабличныйДокумент();
	ТабличныйДокумент.Прочитать(ВременныйФайл, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	
	ОбластьЯчеек = ТабличныйДокумент.Область(1, 1, ТабличныйДокумент.ВысотаТаблицы, ТабличныйДокумент.ШиринаТаблицы); 

	ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьЯчеек);  
	
	ПостроительОтчета = Новый ПостроительОтчета;
	ПостроительОтчета.ИсточникДанных = ИсточникДанных;
	ПостроительОтчета.Выполнить();
	
	ТаблицаДанных = ПостроительОтчета.Результат.Выгрузить();
	
	Возврат ТаблицаДанных;	
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗаполнитьТаблицуДанныхПоДаннымФайлаТинькофф(ТаблицаФайла)
	
	Обработка = Обработки.ЗагрузкаБанковскихВыписок.Создать();
	ТаблицаДанных = Обработка.ДанныеВыписки.Выгрузить();
	
	Для каждого СтрокаДанных из ТаблицаФайла Цикл
		
		НоваяСтрока = ТаблицаДанных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
		
		НоваяСтрока.ИдентификаторКарты = СтрокаДанных.НомерКарты;
		НоваяСтрока.МСС = СтрокаДанных.MCC;
		
	КонецЦикла;
	
	Возврат ТаблицаДанных;
	
КонецФункции

#КонецОбласти
